
ÈçºÎ¹¹½¨Tera£¿

*****************************************************************

TeraµÄ¹¹½¨ÊÇºÜ¼òµ¥µÄ¡£ÓÄ¿Ç°£¬ÓÐÁ½ÖÖ·½Ê½¹©ÄãÑ¡Ôñ£¬Çø±ðÔÚÓÚ±àÒëÒÀÀµ
µÄ¹ÜÀí£ºÈç¹ûÄãÏ£Íû×ÔÐÐ¹ÜÀíTeraµÄÒÀÀµÈí¼þ£¬ÇëÑ¡Ôñ·½Ê½A£¬Èç¹ûÄãÏëÇá
ËÉÒ»µã£¬ÇëÑ¡Ôñ·½Ê½B¡£

*****************************************************************
**                         ¹¹½¨·½Ê½A                           **
*****************************************************************

Ê×ÏÈ£¬È·ÈÏÄãµÄÏµÍ³ÉÏÒÑ¾­°²×°ÁËÒÔÏÂTeraµÄÒÀÀµÈí¼þ£º
* protobuf
* snappy
* sofa-pbrpc
* zookeeper
* glog
* gflags
* gperftools»òtcmalloc
Èç¹ûÃ»ÓÐ£¬ÏÈ°²×°ËüÃÇ¡£×î·½±ãµÄ·½·¨ÊÇÊ¹ÓÃÄãµÄÏµÍ³ÉÏµÄÈí¼þ°ü¹ÜÀíÆ÷£¬
ÀýÈçapt-get¡¢yumµÈµÈ£»»òÕßÍ¨¹ýÔ´Âë±àÒë¡£Ô´ÂëµÄÏÂÔØµØÖ·¿ÉÒÔ²Î¿¼
build.sh¡£

µ±ÄãÒÑ¾­°²×°ºÃÉÏÊöËùÓÐÈí¼þ£¬ÇëÊ¹ÓÃ±à¼­Æ÷´ò¿ªdepends.mk£¬Äã»á·¢ÏÖ
depends.mkÀïÃæÓÐÈýÀà±äÁ¿£¬*_INCDIRÊÇÈí¼þµÄÍ·ÎÄ¼þÄ¿Â¼£¬*_LIBDIRÊÇ
Èí¼þµÄÁ¬½Ó¿âÄ¿Â¼£¬¶ø*_PREFIXÊÇÈí¼þµÄ°²×°Ä¿Â¼£¬Ò»°ãÀ´ËµÍ·ÎÄ¼þÄ¿Â¼
ºÍÁ¬½Ó¿âÄ¿Â¼¾ÍÎ»ÓÚ°²×°Ä¿Â¼Ö®ÏÂ¡£Èç¹ûÈí¼þÊÇÍ¨¹ýÈí¼þ°ü¹ÜÀíÆ÷°²×°µÄ£¬
Ëü»á±»°²×°ÔÚÏµÍ³µÄÄ¬ÈÏ°²×°Ä¿Â¼ÏÂ£¬Èç/usr»ò/usr/local£»Èç¹ûÊÇÍ¨¹ý
±àÒëÔ´Âë°²×°µÄ£¬²¢ÇÒÃ»ÓÐ¼ÓÉÏ--prefix²ÎÊý£¬ËüÍ¬Ñù»á±»°²×°ÔÚÄ¬ÈÏÄ¿
Â¼ÏÂ£»Èç¹ûÖ¸¶¨ÁË--prefix£¬ÄÇÃ´Õâ¸ö²ÎÊý¾ÍÊÇ°²×°Ä¿Â¼¡£Çë°Ñ¸÷¸öÈí¼þ
µÄ°²×°Ä¿Â¼ÌîÐ´ÔÚÏàÓ¦µÄ*_PREFIX=Ö®ºó¡£*_INCDIRºÍ*_LIBDIR½öÔÚÈí¼þ
µÄÍ·ÎÄ¼þºÍÁ¬½Ó¿â²»ÔÚÒ»ÆðÊ±²ÅÐèÒªÐÞ¸Ä¡£

±à¼­Íêdepends.mkÖ®ºó£¬±£´æËü£¬Ö´ÐÐÏÂÃæÈý¸öÃüÁî£º
  sh build_version.sh
  make proto
  make -j4
Èç¹ûÈý¸öÃüÁîÈ«²¿Ö´ÐÐ³É¹¦ÁË£¬ÄÇÃ´¹§Ï²Äã£¬tera¹¹½¨Íê³ÉÁË¡£·ñÔòµÄ»°£¬
Çë¼ì²éÒÀÀµÈí¼þµÄ°æ±¾£¬ÊÇ·ñºÍ½¨ÒéµÄ°æ±¾²»Í¬£¬¹ý¾É»ò¹ýÐÂµÄ°æ±¾¶¼ÓÐ
¿ÉÄÜµ¼ÖÂ±àÒëÊ§°Ü¡£

*****************************************************************
**                         ¹¹½¨·½Ê½B                           **
*****************************************************************

Ê¹ÓÃÕâÖÖ·½Ê½£¬Äã½«ÎÞÐè¹ØÐÄ±àÒëÒÀÀµ£¬µ«ÊÇÖ»ÄÜÔÚ½ÓÈë»¥ÁªÍøµÄÇé¿öÏÂ
½øÐÐ¡£Ö´ÐÐÏÂÃæÕâ¸öÃüÁî£º
  sh build.sh
¾­¹ýÂþ³¤µÄµÈ´ý£¬tera¾Í¹¹½¨Íê³ÉÁË¡£
µ«ÊÇÄãÈÔÓÐ¿ÉÄÜÊ§°Ü¡£Ò»Ð©Èí¼þµÄÏÂÔØµØÖ·¿ÉÄÜÒÑ¾­Ê§Ð§£¨¿ÉÄÜÐÔºÜµÍ£¬
ÎÒÃÇ»á¾­³£¼ì²éµÄ£©£»Ò»Ð©Èí¼þµÄÏÂÔØµØÖ·ÄãÒ²ÐíÎÞ·¨Á¬Í¨£¬¿ÉÒÔ»»¸öÍø
Âç»·¾³ÊÔÊÔ£¬»òÊÇÊ¹ÓÃ´úÀí·þÎñÆ÷¡£


